# Лабораторная №1, Д/з
# Задача: На вход программе подаются 3 коэффициента квадратногоуравнения. Программа должна находить корни квадратного уравнения.
import math
print("введите 3 коэффицента для квадратного уравнения")
a = input("a = ")
a = float(a)
b = input("b = ")
b = float(b)
c = input("c = ")
c = float(c)
d = b ** 2 - 4 * a * c
if d > 0:
    x1 = ((b * (-1)) + math.sqrt(d))/(a * 2)
    x2 = ((b * (-1)) - math.sqrt(d)) / (a * 2)
    print("x1 = ", x1, "x2 = ", x2)
if d == 0:
    x = -b/(a * 2)
    print("x = ", x)
if d < 0-1:
    print('нет корней')


